[
    {
        "id": 11,
        "pergunta": "O princípio da colaboração no DevOps visa exclusivamente a integração entre desenvolvedores e operações, não se aplicando a outras áreas como segurança ou negócios.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. A colaboração no DevOps se estende a todas as áreas envolvidas no ciclo de vida do software, incluindo segurança (DevSecOps) e negócios. A afirmação restringe indevidamente o alcance do princípio.",
        "topico": "DevOps",
        "nivel": "Intermediário"
    },
    {
        "id": 12,
        "pergunta": "O comando 'git rebase' reescreve o histórico de commits de forma linear, enquanto o 'git merge' preserva a estrutura de branches paralelas através de um commit de merge.",
        "resposta_correta": "C",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "CERTO. Esta é exatamente a diferença fundamental entre rebase (história linear) e merge (preserva ramificações).",
        "topico": "Git",
        "nivel": "Intermediário"
    },
    {
        "id": 13,
        "pergunta": "A abordagem declarativa no IaC requer que o usuário especifique cada passo sequencial para configuração da infraestrutura, diferentemente da abordagem imperativa que define apenas o estado final desejado.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. Houve inversão dos conceitos: a abordagem declarativa define o estado final, enquanto a imperativa especifica os passos sequenciais.",
        "topico": "DevOps",
        "nivel": "Intermediário"
    },
    {
        "id": 14,
        "pergunta": "O HEAD no Git é um ponteiro imutável que sempre referencia o commit mais recente do branch principal, não podendo ser movido para outros commits.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. O HEAD é um ponteiro móvel que pode ser posicionado em qualquer commit através do checkout, não ficando restrito ao commit mais recente.",
        "topico": "Git",
        "nivel": "Básico"
    },
    {
        "id": 15,
        "pergunta": "A fase 'DIY DevOps' caracteriza-se pela padronização em uma única plataforma integrada, eliminando a necessidade de customizações e integrações manuais.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. A fase DIY DevOps é justamente marcada por integrações manuais e customizadas entre ferramentas pontuais, não por plataformas unificadas.",
        "topico": "DevOps",
        "nivel": "Intermediário"
    },
    {
        "id": 16,
        "pergunta": "O comando 'git fetch' baixa alterações do repositório remoto e automaticamente as mescla com o branch local, similar ao comportamento do 'git pull'.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. O 'git fetch' apenas baixa as alterações, sem fazer merge automático. O 'git pull' que combina fetch + merge.",
        "topico": "Git",
        "nivel": "Básico"
    },
    {
        "id": 17,
        "pergunta": "A prática de entrega contínua no DevOps depende exclusivamente da automação de testes, não sendo necessária a colaboração entre equipes para sua implementação.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. A colaboração é fundamental no DevOps, e a entrega contínua envolve múltiplos aspectos além da automação de testes, incluindo integração e comunicação entre equipes.",
        "topico": "DevOps",
        "nivel": "Intermediário"
    },
    {
        "id": 18,
        "pergunta": "O comando 'git blame' permite identificar o autor de cada linha de código em um arquivo, sendo útil para rastrear a origem de modificações específicas.",
        "resposta_correta": "C",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "CERTO. Esta é a funcionalidade principal do comando blame no Git.",
        "topico": "Git",
        "nivel": "Intermediário"
    },
    {
        "id": 19,
        "pergunta": "A redução do MTTR (Mean Time To Repair) no DevOps é alcançada principalmente através do aumento do tempo entre entregas, permitindo análises mais aprofundadas.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. A redução do MTTR é alcançada através de entregas mais frequentes e feedback rápido, não do aumento do tempo entre entregas.",
        "topico": "DevOps",
        "nivel": "Intermediário"
    },
    {
        "id": 20,
        "pergunta": "O comando 'git log --oneline' exibe o histórico completo de commits com todas as informações detalhadas, diferentemente do 'git log' padrão que mostra versão resumida.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. É o oposto: '--oneline' mostra versão resumida, enquanto o log padrão mostra informações detalhadas.",
        "topico": "Git",
        "nivel": "Básico"
    },
    {
        "id": 21,
        "pergunta": "Os benefícios do IaC incluem reproducibilidade e versionamento, mas não se aplicam à escalabilidade de infraestrutura, que depende exclusivamente de configurações manuais.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. O IaC é justamente fundamental para escalabilidade automatizada, permitindo dimensionamento conforme demanda.",
        "topico": "DevOps",
        "nivel": "Intermediário"
    },
    {
        "id": 22,
        "pergunta": "O comando 'git checkout -b novo_branch' cria um novo branch e alterna para ele automaticamente, combinando duas operações em um único comando.",
        "resposta_correta": "C",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "CERTO. Esta é a funcionalidade exata da flag -b no comando checkout.",
        "topico": "Git",
        "nivel": "Básico"
    },
    {
        "id": 23,
        "pergunta": "A metodologia DevOps substitui completamente as metodologias ágeis, sendo incompatível com práticas como Scrum ou Kanban.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. DevOps complementa e se integra com metodologias ágeis, não as substitui.",
        "topico": "DevOps",
        "nivel": "Básico"
    },
    {
        "id": 24,
        "pergunta": "O comando 'git reset --hard' descarta permanentemente todas as alterações não commitadas, não podendo ser recuperadas posteriormente.",
        "resposta_correta": "C",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "CERTO. O modo --hard é destrutivo e as alterações descartadas não podem ser recuperadas facilmente.",
        "topico": "Git",
        "nivel": "Intermediário"
    },
    {
        "id": 25,
        "pergunta": "A função do APM (Application Performance Monitoring) no DevOps restringe-se à análise de desempenho de infraestrutura, não incluindo métricas de experiência do usuário final.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. O APM inclui monitoramento da experiência do usuário final, não apenas da infraestrutura.",
        "topico": "DevOps",
        "nivel": "Intermediário"
    },
    {
        "id": 26,
        "pergunta": "O comando 'git merge --no-ff' força a criação de um commit de merge mesmo quando possível fazer fast-forward, preservando o histórico de branches.",
        "resposta_correta": "C",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "CERTO. Esta é a função exata da opção --no-ff no comando merge.",
        "topico": "Git",
        "nivel": "Avançado"
    },
    {
        "id": 27,
        "pergunta": "A prática de monitoramento contínuo no DevOps tem como objetivo principal substituir a necessidade de feedback dos usuários, através da coleta automática de dados.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. O monitoramento complementa mas não substitui o feedback direto dos usuários.",
        "topico": "DevOps",
        "nivel": "Intermediário"
    },
    {
        "id": 28,
        "pergunta": "O Git armazena dados como uma série de snapshots completos do projeto, diferentemente de outros VCS que armazenam apenas listas de mudanças incrementais.",
        "resposta_correta": "C",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "CERTO. Esta é uma característica arquitetural fundamental do Git.",
        "topico": "Git",
        "nivel": "Básico"
    },
    {
        "id": 29,
        "pergunta": "A entrega contínua no DevOps requer obrigatoriamente a utilização de containers Docker, não sendo possível sua implementação com virtualização tradicional.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. A entrega contínua pode ser implementada com diversas tecnologias, incluindo virtualização tradicional.",
        "topico": "DevOps",
        "nivel": "Intermediário"
    },
    {
        "id": 30,
        "pergunta": "O comando 'git diff --staged' mostra as diferenças entre a staging area e o último commit, útil para revisar mudanças antes do commit.",
        "resposta_correta": "C",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "CERTO. Esta é a funcionalidade exata da opção --staged no comando diff.",
        "topico": "Git",
        "nivel": "Intermediário"
    },
    {
        "id": 31,
        "pergunta": "O princípio de 'decisão baseada em dados' no DevOps aplica-se apenas a métricas de desempenho técnico, não incluindo dados de negócio ou satisfação do usuário.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. Decisões baseadas em dados incluem todos os tipos de métricas, técnicas e de negócio.",
        "topico": "DevOps",
        "nivel": "Intermediário"
    },
    {
        "id": 32,
        "pergunta": "O comando 'git tag -a v1.0 -m \"versão 1.0\"' cria uma tag anotada que é armazenada como objeto completo no banco de dados do Git, diferentemente de tags leves.",
        "resposta_correta": "C",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "CERTO. Tags anotadas são objetos completos com metadados, enquanto tags leves são apenas ponteiros.",
        "topico": "Git",
        "nivel": "Avançado"
    },
    {
        "id": 33,
        "pergunta": "A cultura DevOps elimina completamente a necessidade de especialistas em infraestrutura, uma vez que desenvolvedores assumem todas as responsabilidades operacionais.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. DevOps promove colaboração, não eliminação de especialidades. Especialistas em infraestrutura continuam essenciais.",
        "topico": "DevOps",
        "nivel": "Básico"
    },
    {
        "id": 34,
        "pergunta": "O comando 'git rebase -i' permite editar, reorganizar ou combinar commits de forma interativa, oferecendo maior controle sobre o histórico.",
        "resposta_correta": "C",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "CERTO. O rebase interativo (-i) é uma ferramenta poderosa para manipulação do histórico de commits.",
        "topico": "Git",
        "nivel": "Avançado"
    },
    {
        "id": 35,
        "pergunta": "A infraestrutura como código (IaC) é incompatível com ambientes de nuvem pública, sendo aplicável apenas a infraestruturas on-premise.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. O IaC é amplamente utilizado e especialmente valioso em ambientes de nuvem pública.",
        "topico": "DevOps",
        "nivel": "Intermediário"
    },
    {
        "id": 36,
        "pergunta": "O comando 'git remote add origin URL' configura um repositório remoto, mas requer uso adicional de 'git push -u origin main' para definir o upstream padrão.",
        "resposta_correta": "C",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "CERTO. Estes são os passos corretos para configurar e publicar em um repositório remoto pela primeira vez.",
        "topico": "Git",
        "nivel": "Intermediário"
    },
    {
        "id": 37,
        "pergunta": "A métrica de disponibilidade de aplicação no DevOps refere-se exclusivamente ao tempo de atividade do servidor, não incluindo aspectos de performance ou experiência do usuário.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. Disponibilidade inclui aspectos de performance e experiência do usuário, não apenas uptime do servidor.",
        "topico": "DevOps",
        "nivel": "Intermediário"
    },
    {
        "id": 38,
        "pergunta": "O comando 'git commit --amend' permite alterar o último commit, podendo modificar tanto a mensagem quanto o conteúdo do commit, sem criar novo hash.",
        "resposta_correta": "C",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "CERTO. O --amend é usado para corrigir o último commit, substituindo-o por um novo com hash diferente.",
        "topico": "Git",
        "nivel": "Intermediário"
    },
    {
        "id": 39,
        "pergunta": "A implementação de DevOps depende obrigatoriamente da adoção de microsserviços, não sendo compatível com arquiteturas monolíticas.",
        "resposta_correta": "E",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "ERRADO. DevOps pode ser implementado com diversas arquiteturas, incluindo monolíticas.",
        "topico": "DevOps",
        "nivel": "Intermediário"
    },
    {
        "id": 40,
        "pergunta": "O comando 'git grep -i \"palavra\"' realiza busca case-insensitive por uma palavra em todos os arquivos versionados no repositório.",
        "resposta_correta": "C",
        "opcoes_disponiveis": [
            "C",
            "E"
        ],
        "explicacao_feedback": "CERTO. A opção -i no git grep ignora diferenças entre maiúsculas e minúsculas na busca.",
        "topico": "Git",
        "nivel": "Intermediário"
    }
]