[
    {
        "id": 1,
        "pergunta": "O comando <code>git init<\/code> cria um novo repositório vazio em um diretório já existente, e isso garante que, a partir desse momento, todos os arquivos do diretório serão automaticamente versionados sem necessidade de novos comandos.",
        "resposta_correta": "Errado",
        "opcoes_disponiveis": [
            "Certo",
            "Errado"
        ],
        "explicacao_feedback": "<code>git init<\/code> realmente cria um repositório vazio, mas os arquivos não passam a ser automaticamente versionados; é necessário usar <code>git add<\/code> para incluí-los na área de stage. A premissa é verdadeira, mas a conclusão é falsa — típica falsa causalidade CESPE.",
        "topico": "Git",
        "nivel": "Básico"
    },
    {
        "id": 2,
        "pergunta": "O comando <code>git clone<\/code> cria uma cópia completa de um repositório remoto, e isso ocorre exclusivamente por meio do protocolo SSH.",
        "resposta_correta": "Errado",
        "opcoes_disponiveis": [
            "Certo",
            "Errado"
        ],
        "explicacao_feedback": "<code>git clone<\/code> realmente cria uma cópia completa, mas não funciona exclusivamente por SSH; pode usar HTTPS, Git, entre outros. Aqui aparece a armadilha do absoluto — 'exclusivamente'.",
        "topico": "Git",
        "nivel": "Básico"
    },
    {
        "id": 3,
        "pergunta": "<code>git status<\/code> exibe informações sobre arquivos modificados e preparados para commit, porque o Git rastreia automaticamente alterações em todos os arquivos desde o momento em que o repositório é criado.",
        "resposta_correta": "Errado",
        "opcoes_disponiveis": [
            "Certo",
            "Errado"
        ],
        "explicacao_feedback": "<code>git status<\/code> realmente exibe arquivos modificados e staged, mas o Git não rastreia automaticamente os arquivos — é preciso adicioná-los. Há uma premissa verdadeira (função do comando) com explicação falsa (causa equivocada).",
        "topico": "Git",
        "nivel": "Básico"
    },
    {
        "id": 4,
        "pergunta": "O comando <code>git add<\/code> move arquivos para a área de stage, sendo sempre necessário executá-lo novamente após qualquer mudança no arquivo, mesmo que a alteração tenha ocorrido antes de um commit ainda não realizado.",
        "resposta_correta": "Certo",
        "opcoes_disponiveis": [
            "Certo",
            "Errado"
        ],
        "explicacao_feedback": "Após modificar um arquivo novamente, é necessário rodar <code>git add<\/code> para atualizar o stage. O uso de 'sempre' aqui está correto, pois não há exceção: o stage não é atualizado automaticamente.",
        "topico": "Git",
        "nivel": "Básico"
    },
    {
        "id": 5,
        "pergunta": "<code>git commit<\/code> registra alterações definitivas no repositório, e isso implica necessariamente que tais alterações já foram enviadas ao repositório remoto.",
        "resposta_correta": "Errado",
        "opcoes_disponiveis": [
            "Certo",
            "Errado"
        ],
        "explicacao_feedback": "Commit grava apenas no repositório local; não há envio automático. A premissa é correta; a consequência é falsa — típica armadilha de falsa causalidade.",
        "topico": "Git",
        "nivel": "Básico"
    }
]